# Table of contents
**1.Introduction**  
**2. Data Types**  
  2.1 Variables  
  2.2 Numbers  
  2.3 Strings  
  2.4 Lists  
  2.5 Dictionaries  
  2.6 Tuples  
  2.7 Sets  
**3. Comparison Operators**  
**4. If-Else Statements**  
**5. For & While Loop**  
**6. Functions**  
**7. Lambda Functions**  
7.1 Map()  
7.2 filter()  
**8. File I/O**  
**9. Pandas Library Introduction**  
**10. Series**  
10.1 From ndarray  
10.2 From dict  
10.3 From Scalar value  
10.4 Series is ndarray-like  
10.5 Series is dict-like  
10.6 Vectorized operations and label alignment with Series  
10.7 Name Attribute  
**11. Data Frames**  
11.1 From dict of Series or dicts  
11.2 From dict of ndarrays / lists  
11.3 From a list of dicts  
11.4 From a dict of tuples  
11.5 Alternate Constructor  
11.6 Column selection, addition, deletion  
11.7 Indexing / Selection  
11.8 Data alignment and arithmetic  
11.9 Transposing  
**12. Viewing Data**

# 1.Introduction:
- Python is gaining popularity as a language of choice for data analytics.  
- Its installation is free and open source. It is fantastic online community. It is really simple to learn.    
- Data science could adopt it as its standard language.    
- It might also spread to the development of web-based analytics tools.  
- It is simpler to implement because it is written in an interpreted computer language.  
- Compilation is not necessary as immediate execution is possible.

# 2. Data Types:
Data types used in python are following  
# 2.1.Variables:
    In python we donot need to declare variables as in other programming languages. we can  
    simply decide the variable after we have assigned the variable as shown below:

In [2]:
income= 25000 #income variable declaration of integar type
monthly_budget=15.12 # budget declaration of float type
name= "Umais" #name declaration of string type
print(income)#print income 
print(monthly_budget)#print monthly budget
print(name)#print name

25000
15.12
Umais

# 2.2.Numbers:
Number data type simply stores numbers in python. These  
number can be used simply to perform diffrent arthimatic operations  
like addition subtraction etc.

In [3]:
3.1 # float number

3.1

In [4]:
3.1**2.8 # multiplying two numbers

23.758156715596005

In [5]:
28+29 #adding two numbers

57

In [6]:
199.75/23 # dividing two numbers

8.684782608695652

# 2.3. Strings:
In python there is no charachter data types. All single charachter are stored as one length string  
in python. To store any qualitative data we need string data type like given below:

In [7]:
name="umais"
print(name)

umais

**Acess values in String:**  
We can also access specific string value in python like if we have to access first charachter of  
umais string we donont have char in python so we have to access them by using square brackets which will be used to access subtring.

In [8]:
stringVariable = 'Umais Leghari'
print("stringVariable[0]:", stringVariable[0])# print charachter on 0 index or first charachter
print("stringVariable[1:3]:", stringVariable[1:3])#print charachter on 1,3 index or second or fourth charachter  
print("stringVariable[4:5]:", stringVariable[4:5])#print charachter on 4,5 index or fifth or sixth charachter
print("stringVariable[8:10]:", stringVariable[8:10])#print charachter on 8,10 index or ninth or eleventh charachter

stringVariable[0]: U
stringVariable[1:3]: ma
stringVariable[4:5]: s
stringVariable[8:10]: gh

**Updating String**
We can similarly also update a string if we want in python. Simply the new data  
will be overwriiten by the old one by using + operator to update data but new value  
must consist of same data type.

In [9]:
stringVariable = "Umais Leghari"
stringVariable = stringVariable[6:] + "Awais" # first 6 charachters updated
print("Updated string: ", stringVariable)
stringVariable = "Umais Leghari"
stringVariable = stringVariable[:6] + "Awais" # last 6 charachters updated
print("Updated string: ", stringVariable)

Updated string:  LeghariAwais
Updated string:  Umais Awais

** Deleting string:**
    Similarly we can easily delete string just by typing the del keyword  
    in python. like shown below

In [10]:
stringVariable = "Umais Leghari"
print(stringVariable) #string variable value to be printed
del stringVariable #delete variable
print(stringVariable) # Will show error as the variable has been deleted

Umais Leghari

NameError: name 'stringVariable' is not defined

**String special operators:**
Special operators are used for assistence to the user like
  + operator
This operatir is used for the purpose of concatination or to combine two or more words like:

In [15]:
 variable = "Umais"
print(variable+"Leghari") #concation after variable
 variable = "Awais"
print("Leghari"+variable) # concatintion before variable

UmaisLeghari
LeghariAwais

-  '*'   
This is used if we need to show a specific variable for more then one time

In [14]:
 variable = "Awais"
print(variable*5) # print variable value 5 times
 variable = "umais"
print(variable*9) # print variable value 9 times

AwaisAwaisAwaisAwaisAwais
umaisumaisumaisumaisumaisumaisumaisumaisumais

-  '[]'   
This is used print the character of string at given specific index

In [ ]:
variable = "Umais"
print(variable[0]) #print charachter at 0 index or 1 charachter
print(variable[4]) #print charachter at 4 index or 5 charachter
print(variable[2]) #print charachter at 2 index or 3 charachter

-  '[:]'  
This is used to get a range of characters from string like if we want more then one charachter
we use this to return both charachters we want like:

In [13]:
variable = "Umais"
print(variable[0:4]) # print charachter between 0-4 index or 1 to 4 charachter

Umai

-  'in'   
It returns true if given character exists in string, otherwise false however  
if we use not keyword and that charachter is not present then it will again  
return true.

In [12]:
variable = "Umais"
print('U' in variable)# true as u is there in string
print('Z' in variable)# false as no z present
print('X' not in variable)# not keyword used so true

True
False
True

**String formatting operator**
We can also format a given string in python like:

In [11]:
print ("My name is %s and age is %d year!" % ("Umais",21)) # Give proper formatting of text

My name is Umais and age is 21 year!

# 2.4. lists:
Repetition is permitted by list data structures, which means that a single item of data may appear more than once in a list.  
Each entry of recurring data is treated as a separate item or entry when there are several entries of that data.  
It can be expressed as a list of values separated by commas enclosed in square brackets. A List can hold various types of  
data. A list's individual items can be modified (it can be read and write). Like array indices, list indices begin at 0 as well.

In [16]:
list1 = ['Umais','2004']
print(list1)
list2 = ['awais','1976']
print(list2)
list3 = ['Rija','2009']
print(list3)

['Umais', '2004']
['awais', '1976']
['Rija', '2009']

**Accessing values in Lists:**
    To access the values in a list, use square brackets.From a list, we can retrieve a particular value or range of values.

In [17]:
list1 = ['Umais','2004']
list2 = ['awais','1976']
list3 = ['Rija','2009']
list4 = ['physics', 'chemistry', 1997, 2000];
list5 = [1, 2, 3, 4, 5, 6, 7 ];
print ("list1[0]: ", list1[0])
print ("list2[1:5]: ", list2[1:5])
print ("list3[1]: ", list3[1])
print ("list4[2]: ", list4[2])
print ("list5[0:3]: ", list5[0:3])

list1[0]:  Umais
list2[1:5]:  ['1976']
list3[1]:  2009
list4[2]:  1997
list5[0:3]:  [1, 2, 3]

**Updating Lists**
We can update single or mupltiple elements of a list by giving slice on left hand of the assignment operator  
It can also be updated using append() function.

In [18]:
list1 = ['Umais', 'Awais', 1997, 2000];
list1[1] = "doctor"
print(list1)
list1.append('doctor')
print(list1)
list2 = ['Umais', 'Awais', 1997, 2000];
list2[2] = "science"
print(list2)
list1.append('science')
print(list2)

list3 = ['Umais', 'Awais', 1997, 2000];
list3[3] = "enginer"
print(list3)
list1.append('enginer')
print(list3)

['Umais', 'doctor', 1997, 2000]
['Umais', 'doctor', 1997, 2000, 'doctor']
['Umais', 'Awais', 'science', 2000]
['Umais', 'Awais', 'science', 2000]
['Umais', 'Awais', 1997, 'enginer']
['Umais', 'Awais', 1997, 'enginer']

**Delete List element**
When you know the position or index of the element to be destroyed, you can remove using the del command.  
When removing an element but are unsure of its position, you can utilise the remove() function.

In [19]:
list1 = ['Umais', 'Awais', 1997, 2000];
del list1[2]
print(list1)
del list1[0]
print (list1)
list2 = ['physics', 'chemistry', 1997, 2000];
print (list1)
list2.remove('chemistry')
list3 = ['physics', 'rabail', 1997, 2000];
print (list1)
list3.remove('rabail')

['Umais', 'Awais', 2000]
['Awais', 2000]
['Awais', 2000]
['Awais', 2000]

In [20]:
#2.5Dictionaries:
A dictionary is a general-purpose data structure for storing a group of objects.  
A dictionary has a set of keys and each key has a single associated value.  
It is same as array of objects having key and values in PHP.  
Each key is seperated by colon (:) from its value.  
Each item is seperated with comma (,).  
Empty dictionary can be written as {}.  
Keys are unique in dictionary but values may not.  
The values of the dictionary can be of any data type.  
The keys must be of an immutable data type such as strings, numbers, or tuples  
**Accessing value in Dictionary:**
    We can use the familiar square brackets along with the key to obtain its value. Following is a simple example

SyntaxError: invalid syntax (3514997122.py, line 2)

In [21]:
dict = {'Name':"umais", 'Depart': "BCS", 'Batch': 2020}
print (dict['Name'])
dict = {'Name':"mahad", 'Depart': "Bse", 'Batch': 2018}
print (dict['Name'])
dict = {'Name':"zarar", 'Depart': "Bds", 'Batch': 2019}
print (dict['Name'])

umais
mahad
zarar

**Updating Dictionary**
We can update already existing value in dictionary.  
We can also add a new entry in dictionary.

In [22]:
dict = {'Name':"umais", 'Depart': "BCS", 'Batch': 2020}
print (dict)
dict['Batch'] = "SP20"
print (dict)
dict['University'] = "UOL"
print(dict)

dict = {'Name':"Zara", 'Depart': "BCS", 'Batch': 2020}
print (dict)
dict['Batch'] = "fall20"
print (dict)
dict['University'] = "UCP"
print(dict)

{'Name': 'umais', 'Depart': 'BCS', 'Batch': 2020}
{'Name': 'umais', 'Depart': 'BCS', 'Batch': 'SP20'}
{'Name': 'umais', 'Depart': 'BCS', 'Batch': 'SP20', 'University': 'UOL'}
{'Name': 'Zara', 'Depart': 'BCS', 'Batch': 2020}
{'Name': 'Zara', 'Depart': 'BCS', 'Batch': 'fall20'}
{'Name': 'Zara', 'Depart': 'BCS', 'Batch': 'fall20', 'University': 'UCP'}

**Delete Dictionary Element**
We can delete individual element of dicitionary and complete content of dictionary.  
del is used for individual element removal and clear() function is used to remove entire dictionary

In [23]:
dict = {'Name':"Umais", 'Depart': "BCS", 'Batch': 2020}
print (dict)
del dict['Batch']
print (dict)
del dict['Name']
print (dict)
del dict['Depart']
print (dict)

{'Name': 'Umais', 'Depart': 'BCS', 'Batch': 2020}
{'Name': 'Umais', 'Depart': 'BCS'}
{'Depart': 'BCS'}
{}

# 2.6 Tuples
Tuples are almost identical to lists, so they contain an ordered collection of elements, except for one property: they are  
immutable. We would use tuples if we needed a data structure that, once created, cannot be modified anymore.  
It is same as list. The differences between tuples and lists are, the tuples cannot be changed.  
Each item is comma (,) seperated.  
Empty Tuple is shown as ().  
To write a tuple containing a single value you have to include a comma (,) even though there is only one value. For Exampe: tup  = (40,).  
It can also have multiple data type values.  
Like string indices, tuple indices start at 0, and they can be sliced, concatenated, and so on.  
**Accessing values in Tuples**
We can use the familiar square brackets along with the index to obtain its value. Following is an example

In [24]:
tup = ('Math','98', 'C programming', '99')
print (tup)
print(tup[1])
print(tup[1:4])
tp = ('physics','98', 'C++ programming', '99')
print (tp)
print(tp[1])
print(tp[1:])
p = ('Chemistry','98', 'Python', '99')
print (p)
print(p[1])
print(p[1:2])

('Math', '98', 'C programming', '99')
98
('98', 'C programming', '99')
('physics', '98', 'C++ programming', '99')
98
('98', 'C++ programming', '99')
('Chemistry', '98', 'Python', '99')
98
('98',)

**Updating Tuples:**
    Tuples are immutable means we can't change it. It is read only.  
    We are able to take portions of tuples to make a new tuple.

In [25]:
tup1 = (12, 34.56);
tup2 = ('abc', 'xyz');
# Following action is not valid for tuples
# tup1[0] = 100;
# So let's create a new tuple as follows
tup3 = tup1 + tup2;
print (tup3);
tup0 = (12, 34.56);
tup5 = ('abc', 'xyz');
# Following action is not valid for tuples
# tup1[0] = 100;
# So let's create a new tuple as follows
tup7 = tup1 + tup2+ tup0;
print (tup7);
tup8 = tup1 + tup2+ tup0+ tup5;
print(tup8)

(12, 34.56, 'abc', 'xyz')
(12, 34.56, 'abc', 'xyz', 12, 34.56)
(12, 34.56, 'abc', 'xyz', 12, 34.56, 'abc', 'xyz')

**Delete Tuple elements:**
    Removing individual element in Tuple is not possible because they can't be updated.  
    del statment is used to remove entire Tuple.

In [26]:
tup = ('physics', 'chemistry', 1997, 2000);
print (tup);
del tup;
print ("After deleting tup : ");
print (tup);
tup = ('awais', 2345, "Rabail", 2000);
print (tup);
del tup;
print ("After deleting tup : ");
print (tup);

('physics', 'chemistry', 1997, 2000)
After deleting tup :

NameError: name 'tup' is not defined

# 2.7.Sets:
The Set data structure is usually used to test whether elements belong to set of values.  
Rather then only containing elements, Sets are more used to perform operations on multiple  
values at once with methods such as union , intersect , etc. A set is collection of unordered items.  
Every element is unique (No duplicates).  
Every element is immutable (can't be changed). However, the set itself is mutable. We can add or remove items from it.  
Sets can be used to perform mathematical set operations like union, intersection, symmetric difference etc.  
Empty set will be written as {}. Each item in set will be comma (,) seperated. We can make a set from a list using set() function.  
Data type can be found using type() function.  
add() is used to add single value, update() is used for adding multiple values.  
update() function can take tupe, strings, list or other set as argument. In all cases, duplicates will be avoided.  
discard() and remove() are used to to delete particular item from set.
discard() will not raise an error if item doesn't exists in set.  
remove() will raise an error if item doesn't exists in set.

In [27]:
list1 = [1,2,3,4,5]
print (type(list1))
my_set = set(list1)
print(my_set)
print (type(my_set))
# set of integers
my_set = {1,2,3}
print (my_set)
# set of mixed data types
my_set = {1,"Hello", 1.2,'C'}
# adding a single value
my_set.add('D')
#adding multiple values
my_set.update(list1)
print (my_set)
my_set.discard('G') # it will not raise an error
my_set.remove('G') # it will raise an error

<class 'list'>
{1, 2, 3, 4, 5}
<class 'set'>
{1, 2, 3}
{1.2, 1, 'C', 2, 3, 4, 5, 'D', 'Hello'}

KeyError: 'G'

**2.8.Stack:**  
A stack is a linear data structure that stores items in a Last-In/First-Out (LIFO) or First-In/Last-Out (FILO) manner. In stack, a new element is added at one end and an element is removed from that end only. The insert and delete operations are often called push and pop.
The functions associated with stack are:  
empty() – Returns whether the stack is empty – Time Complexity: O(1)  
size() – Returns the size of the stack – Time Complexity: O(1)  
top() / peek() – Returns a reference to the topmost element of the stack – Time Complexity: O(1)  
push(a) – Inserts the element ‘a’ at the top of the stack – Time Complexity: O(1)  
pop() – Deletes the topmost element of the stack – Time Complexity: O(1)

In [28]:
stack = []
 
stack.append('a')
stack.append('b')
stack.append('c')
 
print('Initial stack')
print(stack)
 
# pop() function to pop
# element from stack in
# LIFO order
print('\nElements popped from stack:')
print(stack.pop())
print(stack.pop())
print(stack.pop())
 
print('\nStack after elements are popped:')
print(stack)

Initial stack
['a', 'b', 'c']

Elements popped from stack:
c
b
a

Stack after elements are popped:
[]

** 3. Comparison Operators:**
These are used to compare values (string or numbers) and return true/false according to situation.

In [29]:
1<5

True

In [30]:
15 <= 23

True

In [31]:
'Umais'='Umais'

SyntaxError: cannot assign to literal (444889988.py, line 1)

In [32]:
(1==1) or (5 > 2)

True

# 4:If-Else Statements:
f-Else statments are used to execute a block of code depending on conditions. If block if condition is true otherwise else  
block. See following

In [33]:
if 25 % 2:
 print('Even')
else:
 print('Odd')

Even

In [34]:
if 24 % 2:
 print('Even')
else:
 print('Odd')

Odd

# 5: For and While Loop:
Python has for and while loop for iteration, used when we want to perform a specific  
task repeatedly.

In [35]:
fact = 1
N = 5
for i in range (1,N+1):
 fact*=i

print (fact)

120

In [36]:
a = 0
while a < 10:
 a = a+1
 print(a)

1
2
3
4
5
6
7
8
9
10

In [37]:
multi = 8
N = 5
for i in range (1,N+1):
 multi*=i

print (multi)

960

# 6: Functions:
It is a block of organized and reusable code.  
It is used to perform a single, related action.  
It povides high modularity for your application.  
It has a hight degree of code reusing.  
The syntax is:
def functionname( parameters ):
"function_docstring"
function_suite
return [expression]

In [38]:
def printme( str ):
#This prints a passed string into this function
 print (str)
 return;
# Now you can call printme function
printme("I'm first call to user defined function!")

I'm first call to user defined function!

In [39]:
def printme( int ):
#This prints a passed string into this function
 print (int)
 return;
# Now you can call printme function
printme(178321)

178321

# 7 Lambda Functions:
The creation of anonymous functions at runtime, using a construct called "lambda".  
Lambda function doesn't include return statement, it always contains an expression which is returned.  
This piece of code shows the difference between a normal function definition ("f") and a lambda function ("g"):

In [40]:
def f (x):
 return x**2 # simple function
print (f(8))

64

In [41]:
#Lambda Function
#lambda expressions
times8 = lambda var:var*8
times8(8)
#lambda expressions: another way to write a function in line

64

In [42]:
def f (x):
 return x**2 # simple function
print (f(9))

81

In [43]:
#Lambda Function
#lambda expressions
times9 = lambda var:var*9
times9(9)
#lambda expressions: another way to write a function in line

81

**7.1 Map():**
Map() function is used with two arguments. Just like: r = map(func, seq)  
The first argument func is the name of a function and the second a sequence (e.g. a list).    
seq. map() applies the function func to all the elements of the sequence seq. It returns a new list with the elements changed by func.

In [44]:
Intro = 'My name is Umais Leghari'
words = Intro.split()
print (words)

sentence = 'It is raining cats and dogs'
words = sentence.split()
print (words)
lengths = map(lambda word: len(word), words)
list(lengths)

['My', 'name', 'is', 'Umais', 'Leghari']
['It', 'is', 'raining', 'cats', 'and', 'dogs']

[2, 2, 7, 4, 3, 4]

**7.2.Filter():**
    The function filter(function, list) offers an elegant way to filter out all the elements of a list.  
    The function filter(f,l) needs a function f as its first argument. f returns a Boolean value, i.e.  
    either True or False.This function will be applied to every element of the list l.Only if f returns  
    True will the element of the list be included in the result list.

In [45]:
fib = [0,1,1,2,3,5,8,13,21,34,55]
result1 = filter(lambda x: x % 2, fib)
list(result1)

[1, 1, 3, 5, 13, 21, 55]

In [46]:
fib = [0,1,1,2,3,5,8,13,21,34,55]
result2 = filter(lambda x: x % 2 == 0, fib)
list (result2)

[0, 2, 8, 34]

# 8.File I/O:
**Reading input from Keyboard:**
For reading input from keyboard, raw_input() method is used.  
It reads only one line from standard input and returns it as a string.

In [47]:
from six.moves import input
string = input("Enter your name: ");
print(string)

Enter your name: Umais
Umais

**I/O from or to Text File:**
In this scenario, we'll read and write to a text file.  
r opens a file in read only mode.  
r+ opens a file read and write mode.  
w opens a file in write mode only.  
a opens a file in append mode  
a+ opens a file in append and read mode.

In [ ]:
# Open a file to read
fileOpen = open("file.txt", "r+")
str = fileOpen.read(); #to read specific content from start you can use read(12). It will read 12 characters
from the start of file
print (str)
# Close opend file
fileOpen.close()

Name: Umais Leghari  
Department: BSSe

In [ ]:
# Open a file to append
fileOpen = open("file.txt", "a+")
fileOpen.write(" Information Technology Lahore");
fileOpen.close()
# Open a file to read
fileOpen = open("file.txt", "r+")
string = fileOpen.read(); #to read specific content from start you can use read(12). It will read 12 characte
rs from the start of file
print (string)
# Close opend file
fileOpen.close()

Name: Umais Leghari  
Department: BSCS Information Technology Lahore

**File Position:**
-  tell() method tells the currenct position within the file.  
-  seek() method changes the current file location.

In [ ]:
# Open a file
fo = open("file.txt", "r+")
str = fo.read(10);
print ("Read String is : \n", str)
# Check current position
position = fo.tell();
print ("Current file position : \n", position)
# Reposition pointer at the beginning once again
position = fo.seek(0, 0);
str = fo.read(10);
print ("Again read String is : \n", str)
# Close opend file
fo.close()

Read String is :
Name: Umais
Current file position :
10
Again read String is :
Name: Umais

In [ ]:
import os
# rename a file
os.rename("file.txt", "newfile.txt")

In [ ]:
: #remove file
os.remove("newfile.txt")

# 9: Pandas Intro:
Pandas is an open source library built on top of NumPy  
It allows for fast analysis and data cleaning and preparation  
It excels in proformance and productivity  
It also has built-in visualization features  
It can work with data from a wide variety of sources

# 10. Series:
A series is very similar to NumPy array.Series is 1-D array labeled array capable of holding any type of data.  
The difference between the NumPy array from a Series, is that a Series can have axis labels, meaning it can be  
indexed by a label, instead of just a number location. The axis labels are collectively referred to as the index.  
Following function is used to create a series:s= pd.Series(data,index = index) In above function, data can be  
many different things:  
-  A python dict
-  An ndarray
-  A scalar value (For exmple: 5)  
The passed index is a list of axis labels. So, this seperates into a few cases depending on what data is:
**10.1 From ndarray**
If data is an ndarray, index must be the same length as data.
If no index is passed, one will be created having values [0, ..., len(data) - 1].

In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
"""following a fucntion is called from panas to create a series.
 data would be 5 random values and indexes are assigned a-e"""
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s

a   -0.791951
b   -1.815911
c   -2.089877
d    0.507760
e    0.932812
dtype: float64

In [5]:
 """Following function will print the index and its datatype"""
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [6]:
 """If we don't assign the index then it will of length having values [0......len(data-1)]"""
pd.Series(np.random.randn(5))

0   -1.766857
1   -1.536538
2   -0.474019
3   -1.271052
4   -0.989934
dtype: float64

**10.2 From dict**
-  If data is a dict, if index is passed the values in data corresponding to the labels in the  
index will be pulled out.  
-  If index is not passed then it will be constructed from the sorted keys  
of the dict, if possible.

In [7]:
""" In following example, indexes are not given to it is constructed from the sorted keys of the dict"""
d = {'a' : 0., 'b' : 1., 'c' : 2.} # a python dict
pd.Series(d)

a    0.0
b    1.0
c    2.0
dtype: float64

In [9]:
""" In following example, index are given, so the values in data corresponding in the index will be pulled ou
t"""
pd.Series(d, index=['b', 'c', 'd', 'a'])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

**10.3 From a scalar value:**
- If data is a scalar value, an index must be provided. The value will be repeated to match the length of index

In [10]:
pd.Series(5., index=['a', 'b', 'c', 'd', 'e'])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

**10.4 Series is ndarray-like:**
-  It acts very similarly to a ndarray.
-  It is a valid argument to most NumPy functions. However, things like slicing also slice the index.

In [11]:
#access single value
s[0]

-0.7919509686840663

In [12]:
#access range of values
s[:5]

a   -0.791951
b   -1.815911
c   -2.089877
d    0.507760
e    0.932812
dtype: float64

In [13]:
s[s > s.median()]

d    0.507760
e    0.932812
dtype: float64

In [14]:
s[[4, 3, 1]]

e    0.932812
d    0.507760
b   -1.815911
dtype: float64

In [15]:
np.exp(s)

a    0.452960
b    0.162690
c    0.123702
d    1.661564
e    2.541645
dtype: float64

In [16]:
s['a']

-0.7919509686840663

In [17]:
s['e'] = 12.
s # before updating e = 1.399281 but after updating e = 12.000000

a    -0.791951
b    -1.815911
c    -2.089877
d     0.507760
e    12.000000
dtype: float64

In [18]:
'e' in s

True

In [19]:
s['f']

KeyError: 'f'

In [20]:
s.get('f') #it will return none
s.get('f', np.nan) #it will return default value

nan

**10.6 Vectorized operations and label alignment with Series:**
-  When doing data analysis, as with raw NumPy arrays looping through Series value-by-value is usually not necessary.
-  Series can also be passed into most NumPy methods expecting an ndarray

In [22]:
a = s['a'] + s['a']
b = s['b'] + s['b']
c = s['c'] + s['c']
d = s['d'] + s['d']
e = s['e'] + s['e']

In [ ]:
a = s['a'] *2
b = s['b'] *2
c = s['c'] *2
d = s['d'] *2
e = s['e'] *2"""
s * 2

a -0.819867
b -0.377477
c -2.037099
d 1.900894
e 24.000000
dtype: float64

In [25]:
 s = pd.Series(np.random.randn(5), name='something')
s

0    0.814081
1    0.634174
2   -0.867801
3   -0.682534
4   -1.025407
Name: something, dtype: float64

In [26]:
s.name

'something'

In [27]:
s2 = s.rename("different")
s2.name

'different'

# 11. Data Frames:
-  DataFrames are the workhorse of pandas and are directly inspired by the R programming language.
-  Like Series, DataFrame accepts many different kinds of input:
-  Dict of 1D ndarrays, lists, dicts, or Series
-  2-D numpy.ndarray
-  Structured or record ndarray
-  A Series
-  Another DataFrame
-  Along with the data, you can optionally pass index (row labels) and columns (column labels) arguments.
-  If you pass an index and / or columns, you are guaranteeing the index and / or columns of the resulting DataFrame.
-  Thus, a dict of Series plus a specific index will discard all data not matching up to the passed index.

-  If axis labels are not passed, they will be constructed from the input data based on common sense rules
**11.1 From dict of Series or dicts:**
- The result index will be the union of the indexes of the various Series.
- If there are any nested dicts, these will be first converted to Series.
- If no columns are passed, the columns will be the sorted list of dict keys

In [30]:
d = {
 'one' : pd.Series([1., 2., 3.], index=['1', '2', '3']),
 'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])
 }
"""create a dataframe. row label will be the indes of a series. As coloum labels are not given so it
 will be sorted list of dict keys"""
df = pd.DataFrame(d)
df

   one  two
1  1.0  NaN
2  2.0  NaN
3  3.0  NaN
a  NaN  1.0
b  NaN  2.0
c  NaN  3.0
d  NaN  4.0

In [31]:
pd.DataFrame(d, index=['1', '2', '3'])

   one  two
1  1.0  NaN
2  2.0  NaN
3  3.0  NaN

In [32]:
pd.DataFrame(d, index=['3', '2', '1'], columns=['two', 'three'])

   two three
3  NaN   NaN
2  NaN   NaN
1  NaN   NaN

In [33]:
df.columns

Index(['one', 'two'], dtype='object')

**11.2 From dict of ndarrays / lists:**
-  The ndarrays must all be the same length.
-  If an index is passed, it must clearly also be the same length as the arrays.
-  If no index is passed, the result will be range(n), where n is the array length.

In [35]:
d = {
 'one' : [1., 2., 3., 4.],
 'two' : [4., 3., 2., 1.]
 }

In [37]:
pd.DataFrame(d, index=['1', '2', '3', '4'])

   one  two
1  1.0  4.0
2  2.0  3.0
3  3.0  2.0
4  4.0  1.0

**11.3 From a list of dicts:**

In [40]:
data2 = [{'A': 9, 'B': 18}, {'A': 5, 'B': 10, 'C': 20}]
pd.DataFrame(data2)

   A   B     C
0  9  18   NaN
1  5  10  20.0

In [42]:
"""passing list of dicts as data and indexes (row labels)"""
pd.DataFrame(data2, index=['first', 'second'])

        A   B     C
first   9  18   NaN
second  5  10  20.0

In [43]:
pd.DataFrame(data2, columns=['B', 'C'])

    B     C
0  18   NaN
1  10  20.0

**11.4 From a dict of tuples:**
You can automatically create a multi-indexed frame by passing a tuples dictionary

In [45]:
pd.DataFrame({('Y', 'Z'): {('a', 'b'): 1, ('a', 'c'): 2},
 ('Y', 'Y'): {('a', 'c'): 18, ('Y', 'Z'): 19},
 ('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
 ('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
 ('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}})

       Y          a    b
       Z     Y    c    a     b
a b  1.0   NaN  NaN  NaN   NaN
  c  2.0  18.0  NaN  NaN   NaN
Y Z  NaN  19.0  NaN  NaN   NaN
A B  NaN   NaN  5.0  8.0  10.0
  C  NaN   NaN  6.0  7.0   NaN
  D  NaN   NaN  NaN  NaN   9.0

**11.5 Alternate Constructors:**
- DataFrame.from_dict
- DataFrame.from_dict takes a dict of dicts or a dict of array-like sequences and returns a DataFrame.
- It operates like the DataFrame constructor except for the orient parameter which is 'columns' by default, but which can be set to 'index' in order to use the dict keys as row labels.
- DataFrame.from_records
- DataFrame.from_records takes a list of tuples or an ndarray with structured dtype.
- Works analogously to the normal DataFrame constructor, except that index maybe be a specific field of the structured dtype to use as theindex. For example:

In [46]:
data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')])
data

array([(0, 0., b''), (0, 0., b'')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [49]:
pd.DataFrame.from_records(data, index='B')

     A    C
B
0.0  0  b''
0.0  0  b''

**DataFrame.from_items**
DataFrame.from_items works analogously to the form of the dict constructor that takes a  
sequence of (key, value) pairs, where the keys arecolumn (or row, in the case of orient='index')  
names, and the value are the column values (or row values).This can be useful for constructing a  
DataFrame with the columns in a particular order without having to pass an explicit list of columns

In [ ]:
 pd.DataFrame.from_items([('A', [1, 2, 3]), ('B', [4, 5, 6])])

In [ ]:
pd.DataFrame.from_items([('A', [1, 2, 3]), ('B', [4, 5, 6])],
 orient='index', columns=['one', 'two', 'three'])

**11.6 Column selection, addition, deletion:**
- DataFrame can be treated semantically like a dict of like-indexed Series objects. Getting, setting, and deleting columns works with the same syntax as the analogous dict operations

In [53]:
df['one'] # it is displaying data under coloumn 'one'

1    1.0
2    2.0
3    3.0
a    NaN
b    NaN
c    NaN
d    NaN
Name: one, dtype: float64

In [54]:
df['three'] = df['one'] * df['two']
df['flag'] = df['one'] > 2
df

   one  two  three   flag
1  1.0  NaN    NaN  False
2  2.0  NaN    NaN  False
3  3.0  NaN    NaN   True
a  NaN  1.0    NaN  False
b  NaN  2.0    NaN  False
c  NaN  3.0    NaN  False
d  NaN  4.0    NaN  False

In [55]:
del df['two'] #delete a coloumn 'two' from data frame

In [56]:
three = df.pop('three') #pop a complete coloumn 'three' from dataframe

In [57]:
df

   one   flag
1  1.0  False
2  2.0  False
3  3.0   True
a  NaN  False
b  NaN  False
c  NaN  False
d  NaN  False

In [58]:
df['foo'] = 'bar'

In [59]:
df

   one   flag  foo
1  1.0  False  bar
2  2.0  False  bar
3  3.0   True  bar
a  NaN  False  bar
b  NaN  False  bar
c  NaN  False  bar
d  NaN  False  bar

When inserting a Series that does not have the same index as the DataFrame, it will be conformed to the DataFrame’s index:

In [60]:
df['one_trunc'] = df['one'][:2]

In [61]:
df

   one   flag  foo  one_trunc
1  1.0  False  bar        1.0
2  2.0  False  bar        2.0
3  3.0   True  bar        NaN
a  NaN  False  bar        NaN
b  NaN  False  bar        NaN
c  NaN  False  bar        NaN
d  NaN  False  bar        NaN

In [ ]:
First argument: index where new coloumn will be inserted.
Second argument: label or title of a new coloumn
Third argument: it will create a coloumn at specified position"""
df.insert(1, 'bar2', df['one'])

**11.7 Indexing / Selection:**

In [63]:
df.loc['b']

one            NaN
flag         False
foo            bar
one_trunc      NaN
Name: b, dtype: object

In [64]:
df.iloc[2]

one           3.0
flag         True
foo           bar
one_trunc     NaN
Name: 3, dtype: object

**11.8 Data alignment and arithmetic:**
-  Data alignment between DataFrame objects automatically align on both the columns and the index (row labels).
-  Again, the resulting object will have the union of the column and row labels

In [65]:
 df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])

In [66]:
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])

In [67]:
df + df2

          A         B         C   D
0  2.104179  0.676785 -1.140122 NaN
1  0.346382  2.097710  0.314062 NaN
2 -1.701680 -0.128263  2.149840 NaN
3 -1.929180 -1.633828 -0.196537 NaN
4  0.170031  3.339122 -1.040472 NaN
5  0.372922 -0.094044  2.339194 NaN
6 -0.842030  1.051166 -0.085854 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [68]:
df - df.iloc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1 -0.810599 -0.105098  0.788817 -1.577572
2 -1.299969 -0.995228  3.127983 -1.282809
3 -1.277860 -1.976663  1.095274  0.965473
4 -1.364285  0.377218  0.149023 -1.284381
5 -0.420542 -0.407881  3.063647 -0.303292
6 -2.514870 -1.710879  0.053321  1.132004
7 -1.510774 -1.994880  3.690688 -1.281505
8 -0.680745 -0.549583 -0.369988 -0.680863
9 -0.562808 -2.118674 -0.804690 -0.726031

In [69]:
 df * 5 + 2

          A         B          C         D
0  6.446652  7.371187  -3.202535  3.212898
1  2.393658  6.845698   0.741550 -4.674962
2 -0.053191  2.395048  12.437380 -3.201147
3  0.057353 -2.512130   2.273834  8.040265
4 -0.374773  9.257277  -2.457420 -3.209010
5  4.343945  5.331782  12.115699  1.696439
6 -6.127700 -1.183207  -2.935930  8.872919
7 -1.107219 -2.603216  15.250907 -3.194628
8  3.042925  4.623270  -5.052473 -0.191418
9  3.632613 -3.222183  -7.225986 -0.417258

In [70]:
1 / df

           A          B          C          D
0   1.124441   0.930893  -0.961070   4.122359
1  12.701391   1.031843  -3.973141  -0.749068
2  -2.435234  12.656687   0.479047  -0.961326
3  -2.573808  -1.108124  18.259221   0.827778
4  -2.105464   0.688964  -1.121725  -0.959875
5   2.133156   1.500699   0.494281 -16.471173
6  -0.615180  -1.570743  -1.012980   0.727493
7  -1.609156  -1.086197   0.377333  -0.962533
8   4.794208   1.906018  -0.708971  -2.281628
9   3.062576  -0.957454  -0.541948  -2.068459

In [71]:
df ** 4

          A         B          C         D
0  0.625537  1.331683   1.172142  0.003463
1  0.000038  0.882156   0.004013  3.176254
2  0.028434  0.000039  18.988295  1.170891
3  0.022787  0.663203   0.000009  2.129825
4  0.050887  4.438280   0.631617  1.177987
5  0.048296  0.197163  16.753426  0.000014
6  6.982172  0.164278   0.949721  3.570137
7  0.149145  0.718398  49.329005  1.165032
8  0.001893  0.075769   3.958091  0.036900
9  0.011367  1.189949  11.592339  0.054628

In [72]:
df1 = pd.DataFrame({'a' : [1, 0, 1], 'b' : [0, 1, 1] }, dtype=bool)
df2 = pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)
pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

       a      b
0  False   True
1   True   True
2   True  False

In [73]:
 df1 & df2

       a      b
0  False  False
1  False   True
2   True  False

In [74]:
df1 | df2

      a     b
0  True  True
1  True  True
2  True  True

In [75]:
 -df1

       a      b
0  False   True
1   True  False
2  False  False

**11.9 Transposing:**
-  To transpose, access the T attribute (also the transpose function), similar to an ndarray

In [76]:
df[:5].T

          0         1         2         3         4
A  0.889330  0.078732 -0.410638 -0.388529 -0.474955
B  1.074237  0.969140  0.079010 -0.902426  1.451455
C -1.040507 -0.251690  2.087476  0.054767 -0.891484
D  0.242580 -1.334992 -1.040229  1.208053 -1.041802

In [77]:
df2 = pd.DataFrame({ 'A' : 1.,
 'B' : pd.Timestamp('20130102'),
 'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
 'D' : np.array([3] * 4,dtype='int32'),
 'E' : pd.Categorical(["test","train","test","train"]),
 'F' : 'foo' })

In [78]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [79]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

**12. Viewing Data:**
- We can view data / display data in different ways:
- See the top & bottom rows of the frame
- Selecting a single column
- Selecting via [], which slices the rows
- For getting a cross section using a label
- Selecting on a multi-axis by labe
- Showing label slicing, both endpoints are included
- Reduction in the dimensions of the returned object
- For getting a scalar value
- For getting fast access to a scalar
- Select via the position of the passed integers
- By integer slices, acting similar to numpy/python
- By lists of integer position locations, similar to the numpy/python style
- For slicing rows explicitly
- For slicing columns explicitly
- For getting a value explicitly
- For getting fast access to a scalar
- Using a single column’s values to select data.
- Selecting values from a DataFrame where a boolean condition is met.
- Using the isin() method for filtering

In [80]:
 df.head()

          A         B         C         D
0  0.889330  1.074237 -1.040507  0.242580
1  0.078732  0.969140 -0.251690 -1.334992
2 -0.410638  0.079010  2.087476 -1.040229
3 -0.388529 -0.902426  0.054767  1.208053
4 -0.474955  1.451455 -0.891484 -1.041802

In [81]:
 df.tail(3)

          A         B         C         D
7 -0.621444 -0.920643  2.650181 -1.038926
8  0.208585  0.524654 -1.410495 -0.438284
9  0.326523 -1.044437 -1.845197 -0.483452

In [82]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [83]:
df.values

array([[ 0.88933049,  1.07423732, -1.04050708,  0.24257952],
       [ 0.07873153,  0.96913958, -0.25169005, -1.33499241],
       [-0.41063815,  0.07900962,  2.08747601, -1.04022934],
       [-0.38852932, -0.90242602,  0.05476685,  1.20805302],
       [-0.47495463,  1.45145536, -0.89148396, -1.04180192],
       [ 0.46878894,  0.66635631,  2.02313986, -0.06071213],
       [-1.62553993, -0.63664132, -0.98718606,  1.37458381],
       [-0.62144376, -0.92064316,  2.65018132, -1.03892553],
       [ 0.20858503,  0.52465403, -1.41049465, -0.43828353],
       [ 0.32652251, -1.04443661, -1.84519711, -0.48345159]])

In [84]:
df.sort_index(axis=1, ascending=False)

          D         C         B         A
0  0.242580 -1.040507  1.074237  0.889330
1 -1.334992 -0.251690  0.969140  0.078732
2 -1.040229  2.087476  0.079010 -0.410638
3  1.208053  0.054767 -0.902426 -0.388529
4 -1.041802 -0.891484  1.451455 -0.474955
5 -0.060712  2.023140  0.666356  0.468789
6  1.374584 -0.987186 -0.636641 -1.625540
7 -1.038926  2.650181 -0.920643 -0.621444
8 -0.438284 -1.410495  0.524654  0.208585
9 -0.483452 -1.845197 -1.044437  0.326523

In [85]:
df.sort_values(by='B')

          A         B         C         D
9  0.326523 -1.044437 -1.845197 -0.483452
7 -0.621444 -0.920643  2.650181 -1.038926
3 -0.388529 -0.902426  0.054767  1.208053
6 -1.625540 -0.636641 -0.987186  1.374584
2 -0.410638  0.079010  2.087476 -1.040229
8  0.208585  0.524654 -1.410495 -0.438284
5  0.468789  0.666356  2.023140 -0.060712
1  0.078732  0.969140 -0.251690 -1.334992
0  0.889330  1.074237 -1.040507  0.242580
4 -0.474955  1.451455 -0.891484 -1.041802

In [86]:
df['A']

0    0.889330
1    0.078732
2   -0.410638
3   -0.388529
4   -0.474955
5    0.468789
6   -1.625540
7   -0.621444
8    0.208585
9    0.326523
Name: A, dtype: float64

In [88]:
df.loc[:,['A','B']]

          A         B
0  0.889330  1.074237
1  0.078732  0.969140
2 -0.410638  0.079010
3 -0.388529 -0.902426
4 -0.474955  1.451455
5  0.468789  0.666356
6 -1.625540 -0.636641
7 -0.621444 -0.920643
8  0.208585  0.524654
9  0.326523 -1.044437

In [90]:
df.iloc[3:5,0:2]

          A         B
3 -0.388529 -0.902426
4 -0.474955  1.451455

In [91]:
df.iloc[:,1:3]

          B         C
0  1.074237 -1.040507
1  0.969140 -0.251690
2  0.079010  2.087476
3 -0.902426  0.054767
4  1.451455 -0.891484
5  0.666356  2.023140
6 -0.636641 -0.987186
7 -0.920643  2.650181
8  0.524654 -1.410495
9 -1.044437 -1.845197

In [92]:
df[df.A > 0]

          A         B         C         D
0  0.889330  1.074237 -1.040507  0.242580
1  0.078732  0.969140 -0.251690 -1.334992
5  0.468789  0.666356  2.023140 -0.060712
8  0.208585  0.524654 -1.410495 -0.438284
9  0.326523 -1.044437 -1.845197 -0.483452

In [93]:
df[df > 0]

          A         B         C         D
0  0.889330  1.074237       NaN  0.242580
1  0.078732  0.969140       NaN       NaN
2       NaN  0.079010  2.087476       NaN
3       NaN       NaN  0.054767  1.208053
4       NaN  1.451455       NaN       NaN
5  0.468789  0.666356  2.023140       NaN
6       NaN       NaN       NaN  1.374584
7       NaN       NaN  2.650181       NaN
8  0.208585  0.524654       NaN       NaN
9  0.326523       NaN       NaN       NaN